export const baseUrl = '/trickcal-tools';
export const personalityData: Record<string, string[]> = {
    "cool": [
        "皮可菈",
        "艾斯皮",
        "艾琳娜",
        "艾蜜莉雅",
        "希拉",
        "佩佩",
        "帕特拉",
        "芙莉可",
        "梅露娜",
        "傑德",
        "雷吉",
        "綾"
    ],
    "mad": [
        "大師2號",
        "伊弗利特",
        "希瑟圖",
        "貝麗塔",
        "庫洛艾",
        "梅森",
        "莉茲",
        "愛麗絲",
        "蒂亞娜",
        "瑪約",
        "劉美美",
        "謝蒂"
    ],
    "naive": [
        "大木頭",
        "加薇雅",
        "艾爾芬",
        "希菲爾",
        "阿萊特",
        "海莉",
        "馬爾",
        "莎莉",
        "斯皮奇",
        "路易",
        "薇薇"
    ],
    "jolly": [
        "卡蓮",
        "奶油",
        "米雪",
        "羽伊",
        "艾皮卡",
        "桃桃",
        "泰達",
        "班尼",
        "茱蜜",
        "康娜",
        "路德",
        "瑪麗",
        "盧波"
    ],
    "gloomy": [
        "布蘭切",
        "希爾德",
        "貝魯",
        "佩斯塔",
        "柯米",
        "珀榭",
        "基狄恩",
        "琳",
        "萊薇",
        "橋菲",
        "優米",
        "xX錫安Xx"
    ]
};
export const crayonMap: Record<string, string[][]> = {
    '攻击力': [
        ['綾', '大木頭', '路易', '艾爾芬', '佩斯塔', '芙莉可', '加薇雅', '茱蜜', '馬爾', '瑪麗', '梅露娜', '桃桃', '米雪', '帕特拉', '謝蒂', '斯皮奇', '希拉', '泰達', '貝魯', '優米', '奶油', '希爾德', '艾琳娜', '莉茲'],
        ['艾蜜莉雅', '綾', '大木頭', '康娜', '橋菲', '路易', '艾爾芬', '佩斯塔', '芙莉可', '加薇雅', '海莉', '伊弗利特', '傑德', '茱蜜', '基狄恩', '柯米', '雷吉', '馬爾', '瑪麗', '瑪約', '梅露娜', '桃桃', '米雪', '帕特拉', '皮可菈', '珀榭', '謝蒂', '斯皮奇', '希拉', '泰達', '貝魯', 'xX錫安Xx', '優米', '奶油', '希爾德', '艾琳娜', '莉茲'],
        ['愛麗絲', '艾蜜莉雅', '綾', '貝麗塔', '班尼', '大木頭', '康娜', '庫洛艾', '橋菲', '路易', '艾爾芬', '佩斯塔', '芙莉可', '加薇雅', '海莉', '伊弗利特', '傑德', '茱蜜', '基狄恩', '柯米', '雷吉', '大師2號', '馬爾', '瑪麗', '瑪約', '梅露娜', '桃桃', '米雪', '帕特拉', '皮可菈', '珀榭', '路德', '莎莉', '謝蒂', '希菲爾', '斯皮奇', '希拉', '泰達', '貝魯', '薇薇', '劉美美', 'xX錫安Xx', '優米', '奶油', '希爾德', '艾琳娜', '莉茲', '布蘭切'],
    ],
    '暴击': [
        ['愛麗絲', '阿萊特', '貝麗塔', '班尼', '卡蓮', '庫洛艾', '蒂亞娜', '艾斯皮', '萊薇', '大師2號', '梅森', '琳', '路德', '盧波', '莎莉', '希菲爾', '希瑟圖', '羽伊', '佩佩', '薇薇', '劉美美', '艾皮卡', '布蘭切'],
        ['愛麗絲', '阿萊特', '艾蜜莉雅', '貝麗塔', '班尼', '康娜', '卡蓮', '庫洛艾', '橋菲', '蒂亞娜', '艾斯皮', '海莉', '伊弗利特', '傑德', '基狄恩', '柯米', '雷吉', '萊薇', '大師2號', '梅森', '瑪約', '皮可菈', '珀榭', '琳', '路德', '盧波', '莎莉', '希菲爾', '希瑟圖', '羽伊', '佩佩', '薇薇', '劉美美', 'xX錫安Xx', '艾皮卡', '布蘭切'],
        ['愛麗絲', '阿萊特', '綾', '貝麗塔', '班尼', '大木頭', '卡蓮', '庫洛艾', '路易', '蒂亞娜', '艾爾芬', '艾斯皮', '佩斯塔', '芙莉可', '加薇雅', '茱蜜', '萊薇', '大師2號', '馬爾', '梅森', '瑪麗', '梅露娜', '桃桃', '米雪', '帕特拉', '琳', '路德', '盧波', '莎莉', '謝蒂', '希菲爾', '希瑟圖', '斯皮奇', '希拉', '泰達', '羽伊', '佩佩', '貝魯', '薇薇', '劉美美', '優米', '奶油', '希爾德', '艾琳娜', '莉茲', '艾皮卡', '布蘭切'],
    ],
    'HP': [
        ['愛麗絲', '貝麗塔', '班尼', '大木頭', '庫洛艾', '路易', '芙莉可', '加薇雅', '大師2號', '馬爾', '瑪麗', '梅露娜', '桃桃', '米雪', '路德', '莎莉', '希菲爾', '希拉', '泰達', '薇薇', '劉美美', '希爾德', '莉茲', '布蘭切'],
        ['阿萊特', '艾蜜莉雅', '綾', '康娜', '卡蓮', '橋菲', '蒂亞娜', '艾爾芬', '艾斯皮', '佩斯塔', '海莉', '伊弗利特', '傑德', '茱蜜', '基狄恩', '柯米', '雷吉', '萊薇', '梅森', '瑪約', '帕特拉', '皮可菈', '珀榭', '琳', '盧波', '謝蒂', '希瑟圖', '斯皮奇', '羽伊', '佩佩', '貝魯', 'xX錫安Xx', '優米', '奶油', '艾琳娜', '艾皮卡'],
        ['愛麗絲', '阿萊特', '艾蜜莉雅', '綾', '貝麗塔', '班尼', '康娜', '卡蓮', '庫洛艾', '橋菲', '蒂亞娜', '艾爾芬', '艾斯皮', '佩斯塔', '海莉', '伊弗利特', '傑德', '茱蜜', '基狄恩', '柯米', '雷吉', '萊薇', '大師2號', '梅森', '瑪約', '帕特拉', '皮可菈', '珀榭', '琳', '路德', '盧波', '莎莉', '謝蒂', '希菲爾', '希瑟圖', '斯皮奇', '羽伊', '佩佩', '貝魯', '薇薇', '劉美美', 'xX錫安Xx', '優米', '奶油', '艾琳娜', '艾皮卡', '布蘭切']
    ],
    '暴击抵抗': [
        ['阿萊特', '艾蜜莉雅', '康娜', '卡蓮', '橋菲', '蒂亞娜', '艾斯皮', '海莉', '伊弗利特', '傑德', '基狄恩', '柯米', '雷吉', '萊薇', '梅森', '瑪約', '皮可菈', '珀榭', '琳', '盧波', '希瑟圖', '羽伊', '佩佩', 'xX錫安Xx', '艾皮卡'],
        ['愛麗絲', '阿萊特', '貝麗塔', '班尼', '大木頭', '卡蓮', '庫洛艾', '路易', '蒂亞娜', '艾斯皮', '芙莉可', '加薇雅', '萊薇', '大師2號', '馬爾', '梅森', '瑪麗', '梅露娜', '桃桃', '米雪', '琳', '路德', '盧波', '莎莉', '希菲爾', '希瑟圖', '希拉', '泰達', '羽伊', '佩佩', '薇薇', '劉美美', '希爾德', '莉茲', '艾皮卡', '布蘭切'],
        ['阿萊特', '艾蜜莉雅', '綾', '大木頭', '康娜', '卡蓮', '橋菲', '路易', '蒂亞娜', '艾爾芬', '艾斯皮', '佩斯塔', '芙莉可', '加薇雅', '海莉', '伊弗利特', '傑德', '茱蜜', '基狄恩', '柯米', '雷吉', '萊薇', '馬爾', '梅森', '瑪麗', '瑪約', '梅露娜', '桃桃', '米雪', '帕特拉', '皮可菈', '珀榭', '琳', '盧波', '謝蒂', '希瑟圖', '斯皮奇', '希拉', '泰達', '羽伊', '佩佩', '貝魯', 'xX錫安Xx', '優米', '奶油', '希爾德', '艾琳娜', '莉茲', '艾皮卡'],
    ],
    '防御力': [
        ['艾蜜莉雅', '綾', '康娜', '橋菲', '艾爾芬', '佩斯塔', '海莉', '伊弗利特', '傑德', '茱蜜', '基狄恩', '柯米', '雷吉', '瑪約', '帕特拉', '皮可菈', '珀榭', '謝蒂', '斯皮奇', '貝魯', 'xX錫安Xx', '優米', '奶油', '艾琳娜'],
        ['愛麗絲', '綾', '貝麗塔', '班尼', '大木頭', '庫洛艾', '路易', '艾爾芬', '佩斯塔', '芙莉可', '加薇雅', '茱蜜', '大師2號', '馬爾', '瑪麗', '梅露娜', '桃桃', '米雪', '帕特拉', '路德', '莎莉', '謝蒂', '希菲爾', '斯皮奇', '希拉', '泰達', '貝魯', '薇薇', '劉美美', '優米', '奶油', '希爾德', '艾琳娜', '莉茲', '布蘭切'],
        ['愛麗絲', '阿萊特', '艾蜜莉雅', '貝麗塔', '班尼', '大木頭', '康娜', '卡蓮', '庫洛艾', '橋菲', '路易', '蒂亞娜', '艾斯皮', '芙莉可', '加薇雅', '海莉', '伊弗利特', '傑德', '基狄恩', '柯米', '雷吉', '萊薇', '大師2號', '馬爾', '梅森', '瑪麗', '瑪約', '梅露娜', '桃桃', '米雪', '皮可菈', '珀榭', '琳', '路德', '盧波', '莎莉', '希菲爾', '希瑟圖', '希拉', '泰達', '羽伊', '佩佩', '薇薇', '劉美美', 'xX錫安Xx', '希爾德', '莉茲', '艾皮卡', '布蘭切']
    ],
}